#include <iostream>
using namespace std;
int main() {
    setlocale(LC_ALL, "Russian"); // добавляем русский язык


    cout << "===========================================================\n"; // выводим строки с новой строчки с помощью escape-последовательности \n
    cout << "|   x   ||   y   ||   x and y   ||   x or y  ||   not x   |\n";
    cout << "===========================================================\n";
    cout << "|   0   ||   0   ||     0      ||       0      ||    1    |\n";
    cout << "|   0   ||   1   ||     0      ||       1      ||    1    |\n";
    cout << "|   1   ||   0   ||     0      ||       1      ||    0    |\n";
    cout << "|   1   ||   1   ||     1      ||       1      ||    1    |\n";
    cout << "===========================================================\n";



    return 0;
}